
<img src="img/viu_logo.png" width="200">

## 01MIAR - Estructuras de datos, +Pandas

![logo](img/python_logo.png)

*Ivan Fuertes*

# Operaciones en pandas
- Búsqueda
- Ordenar
- Operaciones matemáticas entre objetos
- apply(lambda)
- Estadística descriptiva
- Ejemplo fuel efficiency

#### Búsqueda

In [2]:
import pandas as pd
import numpy as np

In [3]:
rand_matrix = np.random.randint(6,size=(2,3))
frame = pd.DataFrame(rand_matrix , columns=list('ABC'))
display(frame)

   A  B  C
0  3  0  0
1  3  3  2

In [4]:
# buscando columnas (DataFrame como dic, busca en claves)
'A' in frame

True

In [5]:
# buscando valores
display(frame.isin([3,2])) # --> mask de respuesta (valores que son 3 o 2)

      A      B      C
0  True  False  False
1  True   True   True

In [6]:
# Contar el número de ocurrencias
print(frame.isin([1]).values.sum())
display(frame.isin([1])) #devuelve una mask con valores true si el elemento es 4
type(frame.isin([1]).values) # pandas es una capa alrededor de numpy

0

       A      B      C
0  False  False  False
1  False  False  False

numpy.ndarray

In [7]:
# Cuántos valores son >= 4
mask = frame >= 4
print(mask.values.sum())
display(mask)

0

       A      B      C
0  False  False  False
1  False  False  False

#### Ordenación

In [7]:
from random import shuffle

rand_matrix = np.random.randint(20,size=(5,4))

indices = list(range(5))
shuffle(indices) # mezcla indices

frame = pd.DataFrame(rand_matrix , columns=list('DACB'),index=indices)
display(frame)

    D   A   C   B
0  12   8  11  16
4   3  12  13   2
2  14  16  11  18
3   6   4  17  12
1  19  10   0   9

In [8]:
# ordenar por índice
display(frame.sort_index(ascending=True))

    D   A   C   B
0  12   8  11  16
1  19  10   0   9
2  14  16  11  18
3   6   4  17  12
4   3  12  13   2

In [9]:
#ordenar por columna
display(frame.sort_index(axis=1, ascending=True))

    A   B   C   D
0   8  16  11  12
4  12   2  13   3
2  16  18  11  14
3   4  12  17   6
1  10   9   0  19

In [10]:
# ordenar filas por valor en columna
display(frame.sort_values(by='A', ascending=False))

    D   A   C   B
2  14  16  11  18
4   3  12  13   2
1  19  10   0   9
0  12   8  11  16
3   6   4  17  12

In [11]:
# ordenar columnas por valor en fila
display(frame.sort_values(by=1, axis=1, ascending=True))

    C   B   A   D
0  11  16   8  12
4  13   2  12   3
2  11  18  16  14
3  17  12   4   6
1   0   9  10  19

In [12]:
# ordenar por valor en columna y guardar cambios
frame.sort_values(by='A', ascending=False, inplace=True)
display(frame)

    D   A   C   B
2  14  16  11  18
4   3  12  13   2
1  19  10   0   9
0  12   8  11  16
3   6   4  17  12

#### Ranking
- Construir un ranking de valores

In [13]:
display(frame.rank(method='average'))

     D    A    C    B
2  4.0  5.0  2.5  5.0
4  1.0  4.0  4.0  1.0
1  5.0  3.0  1.0  2.0
0  3.0  2.0  2.5  4.0
3  2.0  1.0  5.0  3.0

In [14]:
# Imprimir, uno a uno, los valores de la columna 'C' de mayor a menor
for x in frame.sort_values(by='C', ascending=False)['C'].values:
    print(x)

17
13
11
11
0

# Operaciones

Operaciones matemáticas entre objetos

In [15]:
matrixA = np.random.randint(100,size=(4,4))
matrixB = np.random.randint(100,size=(4,4))
frameA = pd.DataFrame(matrixA)
frameB = pd.DataFrame(matrixB)
display(frameA)
display(frameB)

    0   1   2   3
0   9  73   5   4
1  24  51  58  99
2  69  73   2  42
3  86  67  77  99

    0   1   2   3
0   4  60  56  77
1  34  72  53  29
2  34  71  79  45
3   7  85  75  94

In [16]:
# a través de métodos u operadores
display(frameA + frameB == frameA.add(frameB))
display(frameA + frameB)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

     0    1    2    3
0   13  133   61   81
1   58  123  111  128
2  103  144   81   87
3   93  152  152  193

In [17]:
display(frameB - frameA == frameB.sub(frameA))
display(frameB - frameA)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

    0   1   2   3
0  -5 -13  51  73
1  10  21  -5 -70
2 -35  -2  77   3
3 -79  18  -2  -5

In [18]:
# si los frames no son iguales, valor por defecto NaN
frameC = pd.DataFrame(np.random.randint(100,size=(3,3)))
display(frameA)
display(frameC)
display(frameA + frameC)

    0   1   2   3
0   9  73   5   4
1  24  51  58  99
2  69  73   2  42
3  86  67  77  99

    0   1   2
0  51  12  88
1  44   3  19
2  91  97  29

       0      1     2   3
0   60.0   85.0  93.0 NaN
1   68.0   54.0  77.0 NaN
2  160.0  170.0  31.0 NaN
3    NaN    NaN   NaN NaN

In [21]:
# se puede especificar el valor por defecto con el argumento fill_value
display(frameA.sub(frameC,fill_value=0))

      0     1     2     3
0 -42.0  61.0 -83.0   4.0
1 -20.0  48.0  39.0  99.0
2 -22.0 -24.0 -27.0  42.0
3  86.0  67.0  77.0  99.0

Operadores aritméticos solo válidos en elementos aceptables

In [22]:
frameD = pd.DataFrame({0: ['a','b'],1:['d','f']})
display(frameD)
# frameA - frameD

   0  1
0  a  d
1  b  f

Operaciones entre Series y DataFrames

In [23]:
rand_matrix = np.random.randint(10, size=(3, 4))
df = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(df)
display(type(df.iloc[0]))
# uso común, averiguar la diferencia entre una fila y el resto
display(df - df.iloc[0])
# Por columnas cómo se restaría
display(df.sub(df['A'], axis=0))

   A  B  C  D
0  7  8  0  0
1  3  7  6  7
2  0  0  9  6

pandas.core.series.Series

   A  B  C  D
0  0  0  0  0
1 -4 -1  6  7
2 -7 -8  9  6

   A  B  C  D
0  0  1 -7 -7
1  0  4  3  4
2  0  0  9  6

pandas se basa en NumPy, np operadores binarios y unarios son aceptables 

| Tipo | Operación | Descripción |
|:---------|:-----|:-----|
| Unario | *abs* | Valor absoluto de cada elemento |
| | *sqrt* | Raíz cuadrada de cada elemento |
| | *exp* | e^x, siendo x cad elemento |
| | *log, log10, log2* | Logaritmos en distintas bases de cada elemento |
| | *sign* | Retorna el signo de cada elemento (-1 para negativo, 0 o 1 para positivo) |
| | *ceil* | Redondea cada elemento por arriba |
| | *floor* | Redondea cada elemento por abajo |
| | *isnan* | Retorna si cada elemento es Nan |
| | *cos, sin, tan* | Operaciones trigonométricas en cada elemento |
| | *arccos, arcsin, arctan* | Inversas de operaciones trigonométricas en cada elemento |
| Binario | *add* | Suma de dos arrays |
| | *substract* | Resta de dos arrays |
| | *multiply* | Multiplicación de dos arrays |
| | *divide* | División de dos arrays |
| | *maximum, minimum* | Retorna el valor máximo/mínimo de cada pareja de elementos |
| | *equal, not_equal* | Retorna la comparación (igual o no igual) de cada pareja de elementos |
| | *greater, greater_equal, less, less_equal* | Retorna la comparación (>, >=, <, <= respectivamente) de cada pareja de elementos |

Aplicación de funciones a medida con lambda

In [24]:
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)
print(frame.apply(lambda x : x.max() - x.min())) # diferencia por columna

   A  B  C  D
0  0  7  2  3
1  8  9  3  7
2  4  3  8  9

A    8
B    6
C    6
D    6
dtype: int64

In [25]:
# diferencia entre min y max por fila (no columna)
rand_matrix = np.random.randint(10, size=(3, 4))
frame = pd.DataFrame(rand_matrix , columns=list('ABCD'))
display(frame)
print(frame.apply(lambda x : x.max() - x.min(), axis = 1)) # diferencia por fila

   A  B  C  D
0  5  9  4  8
1  2  9  3  8
2  3  0  3  4

0    5
1    7
2    4
dtype: int64

# Estadística descriptiva
- Análisis preliminar de los datos
- Para Series y DataFrame

In [26]:
diccionario = { "nombre" : ["Marisa","Laura","Manuel", "Carlos"], "edad" : [34,34,11, 30], 
               "puntos" : [98,12,98,40], "genero": ["F", "F", "M", "M"] }
frame = pd.DataFrame(diccionario)
display(frame)
display(frame.describe(include='all')) # datos generales de elementos

   nombre  edad  puntos genero
0  Marisa    34      98      F
1   Laura    34      12      F
2  Manuel    11      98      M
3  Carlos    30      40      M

       nombre       edad     puntos genero
count       4   4.000000   4.000000      4
unique      4        NaN        NaN      2
top     Laura        NaN        NaN      F
freq        1        NaN        NaN      2
mean      NaN  27.250000  62.000000    NaN
std       NaN  10.996211  43.112257    NaN
min       NaN  11.000000  12.000000    NaN
25%       NaN  25.250000  33.000000    NaN
50%       NaN  32.000000  69.000000    NaN
75%       NaN  34.000000  98.000000    NaN
max       NaN  34.000000  98.000000    NaN

In [27]:
print(type(frame['edad']))

<class 'pandas.core.series.Series'>

In [28]:
# operadores básicos
frame.sum()

nombre    MarisaLauraManuelCarlos
edad                          109
puntos                        248
genero                       FFMM
dtype: object

In [29]:
frame.mean(numeric_only=True)

edad      27.25
puntos    62.00
dtype: float64

In [30]:
frame.cumsum()

                    nombre  edad  puntos genero
0                   Marisa    34      98      F
1              MarisaLaura    68     110     FF
2        MarisaLauraManuel    79     208    FFM
3  MarisaLauraManuelCarlos   109     248   FFMM

In [31]:
frame.count()

nombre    4
edad      4
puntos    4
genero    4
dtype: int64

In [37]:
frame['edad'].std()

10.996211468804457

In [38]:
frame['edad'].idxmax()

0

In [39]:
frame['puntos'].idxmin()

1

In [35]:
# frame con las filas con los valores maximos de una columna
print(frame['puntos'].max())
display(frame[frame['puntos'] == frame['puntos'].max()])

98

   nombre  edad  puntos genero
0  Marisa    34      98      F
2  Manuel    11      98      M

## Agregaciones

In [36]:
display(frame)
display(frame.groupby('genero').count())

   nombre  edad  puntos genero
0  Marisa    34      98      F
1   Laura    34      12      F
2  Manuel    11      98      M
3  Carlos    30      40      M

        nombre  edad  puntos
genero
F            2     2       2
M            2     2       2

In [40]:
display(frame.groupby('genero').mean())

        edad  puntos
genero
F       34.0    55.0
M       20.5    69.0

In [41]:
display(frame.groupby('genero').max())

        nombre  edad  puntos
genero
F       Marisa    34      98
M       Manuel    30      98

In [42]:
# funciones de agregación de varias columnas para obtener distintos estadísticos
display(frame.groupby('genero')[['edad', 'puntos']].aggregate(['min', np.median, max]))

       edad            puntos
        min median max    min median max
genero
F        34   34.0  34     12     55  98
M        11   20.5  30     40     69  98

In [43]:
# Filtrado de los datos en el que el conjunto no supera una media determinada 
def media(x):
    return x["edad"].mean() > 30

frame.groupby('genero').filter(media)

   nombre  edad  puntos genero
0  Marisa    34      98      F
1   Laura    34      12      F

# Ejemplo Fuel efficiency
- https://archive.ics.uci.edu/ml/datasets/Auto+MPG

In [45]:
import pandas as pd
path = 'http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data'

mpg_data = pd.read_csv(path, delim_whitespace=True, header=None,
            names = ['mpg', 'cilindros', 'desplazamiento','potencia',
            'peso', 'aceleracion', 'año', 'origen', 'nombre'],
            na_values='?')

In [46]:
display(mpg_data.sample(5))

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
379,36.0,4,98.0,70.0,2125.0,17.3,82,1,mercury lynx l
386,25.0,6,181.0,110.0,2945.0,16.4,82,1,buick century limited
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
75,14.0,8,318.0,150.0,4077.0,14.0,72,1,plymouth satellite custom (sw)
273,23.9,4,119.0,97.0,2405.0,14.9,78,3,datsun 200-sx

In [47]:
display(mpg_data.describe(include='all'))

,mpg,cilindros,desplazamiento,potencia,peso,aceleracion,año,origen,nombre
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000,NaN

In [48]:
mpg_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   mpg             398 non-null    float64
 1   cilindros       398 non-null    int64
 2   desplazamiento  398 non-null    float64
 3   potencia        392 non-null    float64
 4   peso            398 non-null    float64
 5   aceleracion     398 non-null    float64
 6   año             398 non-null    int64
 7   origen          398 non-null    int64
 8   nombre          398 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 28.1+ KB

### Correlaciones entre valores

pandas incluye métodos para analizar correlaciones
- Relación matemática entre dos variables (-1 negativamente relacionadas, 1 positivamente relacionadas, 0 sin relación)
- obj.corr(obj2) --> medida de correlación entre los datos de ambos objetos
- https://blogs.oracle.com/ai-and-datascience/post/introduction-to-correlation

In [ ]:
mpg_data['mpg'].corr(mpg_data['peso']) # + mpg = - peso

In [ ]:
mpg_data['peso'].corr(mpg_data['aceleracion']) # + peso = - aceleracion

### Correlaciones entre todos los valores

In [ ]:
mpg_data.corr()

In [ ]:
#año y origen no parecen correlacionables
#eliminar columnas de la correlacion
corr_data = mpg_data.drop(['año','origen'],axis=1).corr()
display(corr_data)

In [ ]:
# representación gráfica matplotlib
import matplotlib.pyplot as plt

In [ ]:
# representación gráfica
corr_data.style.background_gradient(cmap=plt.get_cmap('RdYlGn'), axis=1)

In [ ]:
# correlación más negativa
mpg_data.drop(['año','origen'],axis=1).corr().idxmin()

In [ ]:
# correlación más positiva
mpg_data.drop(['año','origen'],axis=1).corr().idxmax()  #consigo misma....

In [ ]:
# tabla similar con las correlaciones más positivas (evitar parejas del mismo valor)
positive_corr = mpg_data.drop(['año','origen'],axis=1).corr()
np.fill_diagonal(positive_corr.values, 0)
display(positive_corr)
positive_corr.idxmax()

In [ ]:
positive_corr.style.background_gradient(cmap=plt.get_cmap('RdYlGn'), axis=1)